[
    {
        "areaOfFocus": "Anger Control Problems",
        "longTermGoals": [
            "Learn and implement anger management skills to reduce the level of anger and irritability that accompanies it.",
            "Increase honest, appropriate, respectful, and direct communication using assertiveness and conflict resolution skills.",
            "Develop an awareness of angry thoughts, feelings, and actions, clarifying origins of, and learning alternatives to aggressive anger.",
            "Decrease the frequency, intensity, and duration of angry thoughts, feelings, and actions and increase the ability to recognize and assertively express frustration and resolve conflict.",
            "Implement cognitive behavioral skills necessary to solve problems in a more constructive manner.",
            "Come to an awareness and acceptance of angry feelings while developing better control and more serenity.",
            "Become capable of handling angry feelings in constructive ways that enhance daily functioning.",
            "Demonstrate respect for the rights of others to have their own thoughts and feelings."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Identify situations, thoughts, and feelings associated with anger, angry verbal and/or behavioral actions, and the targets of those actions.",
            "Complete psychological testing or objective questionnaires for assessing anger expression.",
            "Cooperate with a complete medical evaluation.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Explore the consequences of anger, motivation, and willingness to participate in treatment, and agree to participate to learn new ways to think about and manage anger.",
            "Cooperate with a medication evaluation for possible treatment with psychotropic medications to assist in anger control; take medications consistently, if prescribed.",
            "Keep a daily journal of persons, situations, and other triggers of anger; record thoughts, feelings, and actions taken or not.",
            "Verbalize increased awareness of anger expression patterns, their causes, and their consequences.",
            "Verbalize an understanding of how the treatment is designed to help regulate anger, effectively manage it, and improve quality of life.",
            "Read material that supplements the therapy by improving understanding of anger, anger control problems, and their management.",
            "Learn and implement calming and coping strategies as part of an overall approach to managing anger.",
            "Identify, challenge, and replace anger.inducing self. talk with self talk that facilitates a more measured response.",
            "Learn and implement thought stopping as part of new approach to managing angry feelings when they arise.",
            "Learn and implement assertive communication skills for addressing frustration and anger in an honest, appropriate, respectful, and direct manner.",
            "Learn and implement problem solving/solution finding skills and/or conflict resolution skills to address personal and interpersonal problems.",
            "Practice using new anger management skills in session with the therapist and during homework exercises.",
            "Decrease the number, intensity, and duration of angry outbursts, while increasing the use of new skills for managing anger.",
            "Verbalize an understanding of relapse prevention and the difference between a lapse and relapse.",
            "Identify potential situations that could trigger a lapse and implement strategies to manage these situations.",
            "Identify the advantages and disadvantages of holding on to anger and of forgiveness; discuss with therapist.",
            "Write a letter of forgiveness to the perpetrator of past or present pain and process this letter with the therapist.",
            "Participate in acceptance and commitment therapy (ACT) for learning a new approach to anger and anger management.",
            "Learn and implement mindfulness meditation as part of a new approach to anger management and improved quality of life.",
            "Gain insight into the origins of current anger control problems by discussing experiences that may be involved in their development.",
            "Identify social supports that will help facilitate the implementation of anger management skills."
        ]
    },
    {
        "areaOfFocus": "Antisocial Behavior",
        "longTermGoals": [
            "Accept responsibility for own behavior and keep behavior within the acceptable limits of the rules of society.",
            "Develop and demonstrate a healthy sense of respect for social norms, the rights of others, and the need for honesty.",
            "Improve method of relating to the world, especially authority figures; be more realistic, less defiant, and more socially sensitive.",
            "Come to an understanding and acceptance of the need for conforming to prevailing social limits and boundaries on behavior.",
            "Maintain consistent employment and demonstrate financial and emotional responsibility for children.",
            "Embrace the recovery model's emphasis on accepting responsibility for treatment decisions as well as the expectation of being able to live, work, and participate fully in the community."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Admit to illegal and/or unethical behavior that has trampled on the law and/or the rights and feelings of others.",
            "Provide honest and complete information for a substance use history.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Explore and resolve ambivalence associated with commitment to change behaviors related to antisocial behavior pattern, including substance abuse if present.",
            "Verbalize an understanding of the benefits for self and others of living within the laws and rules of society.",
            "Make a commitment to live within the rules and laws of society.",
            "List relationships that have been broken because of disrespect, disloyalty, aggression, or dishonesty.",
            "Acknowledge a pattern of self centeredness in virtually all relationships.",
            "Make a commitment to be honest and reliable.",
            "Verbalize an understanding of the benefits to self and others of being empathetic and sensitive to the needs of others.",
            "List three actions that will be performed that will be acts of kindness and thoughtfulness toward others.",
            "Indicate the steps that will be taken to make amends or restitution for hurt caused to others.",
            "Verbally demonstrate an understanding of the rules and duties related to employment.",
            "Attend work reliably and treat supervisors and coworkers with respect.",
            "Verbalize the obligations of parenthood that have been ignored.",
            "State a plan to meet responsibilities of parenthood.",
            "Increase statements of accepting responsibility for own behavior.",
            "Verbalize an understanding of how childhood experiences of pain have led to an imitative pattern of self focused protection and aggression toward others.",
            "Identify situations, thoughts, and feelings that trigger anger, angry verbal and/or aggressive behavioral actions.",
            "Complete psychological testing or objective questionnaires for assessing anger expression.",
            "Learn and implement calming and coping strategies as part of an overall approach to managing anger.",
            "Identify, challenge, and replace anger inducing self talk with self talk that facilitates a less angry reaction.",
            "Verbalize a list of constructive alternatives to aggressive anger in response to trigger situations.",
            "Verbalize a desire to forgive perpetrators of childhood abuse.",
            "Practice trusting a significant other with disclosure of personal feelings."
        ]
    },
    {
        "areaOfFocus": "Anxiety",
        "longTermGoals": [
            "Reduce overall frequency, intensity, and duration of the anxiety so that daily functioning is not impaired.",
            "Stabilize anxiety level while increasing ability to function on a daily basis.",
            "Resolve the core conflict that is the source of anxiety.",
            "Enhance ability to effectively cope with the full variety of life's worries and anxieties.",
            "Learn and implement coping skills that result in a reduction of anxiety and worry, and improved daily functioning."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe situations, thoughts, feelings, and actions associated with anxieties and worries, their impact on functioning, and attempts to resolve them.",
            "Complete psychological tests designed to assess worry and anxiety symptoms.",
            "Cooperate with and complete a medical evaluation.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Cooperate with a medication evaluation by a prescriber.",
            "Verbalize an understanding of the cognitive, physiological, and behavioral components of anxiety and its treatment.",
            "Learn and implement calming skills to reduce overall anxiety and manage anxiety.",
            "Learn and implement a strategy to limit the association between various environmental settings and worry, delaying the worry until a designated 'worry time'.",
            "Verbalize an understanding of the role that thinking plays in worry, anxiety, and avoidance.",
            "Identify, challenge, and replace biased, fearful self talk with positive, realistic, and empowering self talk.",
            "Participate in gradual imaginal and/or live exposure to the feared negative consequences predicted by worries and develop alternative reality based predictions.",
            "Learn and implement problem solving strategies for realistically addressing worries.",
            "Identify and engage in rewarding activities on a daily basis.",
            "Learn and implement personal and interpersonal skills to reduce anxiety and improve interpersonal relationships.",
            "Learn a nonjudgmental, accepting approach to worries, overcoming avoidance, and engaging in action toward personally meaningful goals.",
            "Learn and implement relapse prevention strategies for preventing or managing possible setbacks.",
            "Discuss ambivalence about changing current worry patterns toward deciding on whether to make changes.",
            "Utilize a paradoxical intervention technique to reduce the anxiety response.",
            "Complete a cost benefit analysis of maintaining the anxiety.",
            "Identify the major life conflicts from the past and present that form the basis for present anxiety.",
            "Maintain involvement in work, family, and social activities.",
            "Reestablish a consistent sleep wake cycle."
        ]
    },
    {
        "areaOfFocus": "Attention Deficit Hyperactivity Disorder (ADHD)—Adult",
        "longTermGoals": [
            "Sufficiently reduce inattentive/hyperactive/combined symptoms to function effectively in daily life.",
            "Reduce impulsive actions while increasing concentration and focus on activities.",
            "Minimize ADHD behavioral interference in daily life.",
            "Accept ADHD as a chronic issue and need for continuing medication treatment.",
            "Sustain attention and concentration for consistently longer periods of time.",
            "Achieve a satisfactory level of balance, structure, and intimacy in personal life."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe past and present experiences with ADHD including its effects on functioning.",
            "Cooperate with and complete psychological testing.",
            "Cooperate with and complete a medical evaluation.",
            "Comply with all recommendations based on the medical and/or psychological evaluations.",
            "Participate in a medication evaluation and take medication as prescribed, if prescribed.",
            "Disclose any history of substance use that may contribute to and complicate the treatment of ADHD.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Identify the current specific ADHD behaviors that cause the most difficulty.",
            "List the negative consequences of the ADHD problematic behavior.",
            "Invite a significant other to join in the therapy to provide support throughout therapy.",
            "Significant other learns the HOPE technique to help support the client's positive changes.",
            "Increase knowledge of ADHD and its treatment.",
            "Read self help books about ADHD to improve understanding of the condition and its features.",
            "Learn and implement organization and planning skills.",
            "Learn and implement skill to reduce the disruptive influence of distractibility.",
            "Identify, challenge, and change self talk that contributes to maladaptive feelings and actions.",
            "Acknowledge procrastination and the need to reduce it.",
            "Learn and implement skills to reduce procrastination.",
            "Combine skills learned in therapy into a new daily approach to managing ADHD.",
            "Implement relaxation procedures to reduce tension and physical restlessness.",
            "List coping skills that will be used to manage ADHD symptoms.",
            "Learn and practice mindful meditation to enhance attentional focus.",
            "Attend an ADHD support group with or without significant other.",
            "Report improved listening skills without defensiveness."
        ]
    },
    {
        "areaOfFocus": "Bipolar Disorder—Depression",
        "longTermGoals": [
            "Alleviate depressive symptoms and return to previous level of effective functioning.",
            "Develop healthy thinking patterns and beliefs about self, others, and the world that lead to the alleviation of depression and help prevent its relapse.",
            "Develop healthy interpersonal relationships that lead to the alleviation of depression and help prevent its relapse.",
            "Appropriately grieve the loss in order to normalize mood and to return to previously adaptive level of functioning.",
            "Normalize energy level and return to usual activities, good judgment, stable mood, more realistic expectations, and goal directed behavior.",
            "Achieve controlled behavior, moderated mood, more deliberative speech and thought process, and a stable daily activity pattern.",
            "Optimize sleep and activity patterns that lead to alleviation of depression and help prevent its relapse.",
            "Build self esteem or reduce guilt, fears of rejection, dependency, or abandonment."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Participate in an evaluation of your present and past experiences with changes in mood, including their impact on functioning and quality of life.",
            "Complete psychological testing to assess the nature and impact of mood problems.",
            "Cooperate with and complete a medical evaluation.",
            "Disclose any history of substance use that may contribute to mood vulnerabilities or complicate treatment.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Verbalize any history of past and present suicidal thoughts and actions.",
            "State no longer having thoughts of self harm.",
            "Cooperate with a medication evaluation for medication needs to stabilize symptoms.",
            "Take prescribed medications as directed.",
            "Achieve a level of symptom stability that allows for meaningful participation in psychotherapy.",
            "Verbalize an understanding of the causes for, symptoms of, and treatment of depressive episodes within bipolar disorder.",
            "Verbalize an understanding of the rationale for treatment.",
            "Verbalize acceptance of the need to take psychotropic medication and commit to prescription adherence including possible blood level monitoring.",
            "Attend group sessions designed to inform members of the nature, causes, and treatment of bipolar disorder, as well as skills for managing it.",
            "Client and family members verbalize an understanding of bipolar disorder, factors that influence it, and the important role of medication and therapy.",
            "Family members implement skills that help manage the client's bipolar disorder, prevent relapse, and improve the quality of life of the family and its members.",
            "Develop a “relapse drill” in which roles, responsibilities, and a course of action are agreed upon in the event that signs of relapse emerge.",
            "Identify and replace thoughts and behaviors that may trigger manic or depressive symptoms.",
            "Maintain a pattern of regular rhythm to daily activities.",
            "Discuss and resolve troubling personal and interpersonal issues.",
            "Participate in periodic “maintenance therapy” sessions.",
            "Increase understanding of bipolar disorder by reading a recommended book on the disorder.",
            "Differentiate between real and imagined losses, rejections, and abandonments.",
            "Verbalize grief, fear, and anger regarding real or imagined losses in life.",
            "Increase value based actions in daily life while learning how to manage thoughts and feelings that would stop or decrease these actions.",
            "Increasingly verbalize hopeful and positive statements regarding self, others, and the future."
        ]
    },
    {
        "areaOfFocus": "Bipolar Disorder—Mania",
        "longTermGoals": [
            "Alleviate manic/hypomanic mood and return to previous level of effective functioning.",
            "Normalize energy level and return to usual activities, good judgment, stable mood, more realistic expectations, and goal directed behavior.",
            "Reduce agitation, impulsivity, and pressured speech while achieving sensitivity to the consequences of behavior and having more realistic expectations.",
            "Achieve controlled behavior, moderated mood, more deliberative speech and thought process, and a stable daily activity pattern.",
            "Develop healthy cognitive patterns and beliefs about self and the world that lead to alleviation and help prevent the relapse of manic/hypomanic episodes.",
            "Talk about and gain insight and strength in addressing guilt, fears of rejection, dependency, and abandonment that foster feelings of low self worth."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe mood state, energy level, amount of control over thoughts, and sleeping pattern.",
            "Complete psychological testing to assess the nature and impact of mood problems.",
            "Cooperate with and complete a medical evaluation.",
            "Disclose any history of substance use that may contribute to and complicate the treatment of bipolar disorder.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Verbalize any history of past and present suicidal thoughts and actions.",
            "State no longer having thoughts of self harm.",
            "Cooperate with a medication evaluation to reduce symptoms and stabilize mood.",
            "Take prescribed medications as directed.",
            "Achieve a level of symptom stability that allows for meaningful participation in psychotherapy.",
            "Verbalize an understanding of the causes for, symptoms of, and treatment of manic or hypomanic episodes.",
            "Verbalize acceptance of the need to take psychotropic medication and commit to prescription adherence with possible blood level monitoring.",
            "Attend group psychoeducational sessions designed to inform members of the nature, causes, and treatment of bipolar disorder.",
            "Identify and replace thoughts and behaviors that may trigger manic or depressive symptoms.",
            "Client and family members verbalize an understanding of bipolar disorder, factors that influence it, and the role of medication and therapy in its management.",
            "Family members implement skills that help manage the client's bipolar disorder and improve the quality of life of the family and its members.",
            "Develop a “relapse drill” in which roles, responsibilities, and a course of action are agreed upon in the event that signs of relapse emerge.",
            "Maintain a pattern of regular rhythm to daily activities.",
            "Discuss and resolve troubling personal and interpersonal issues.",
            "Participate in periodic “maintenance” sessions.",
            "Increase understanding of bipolar disorder by reading or viewing information on the disorder and its management.",
            "Differentiate between real and imagined losses, rejections, and abandonments.",
            "Verbalize grief, fear, and anger regarding real or imagined losses in life.",
            "Acknowledge the low self esteem and fear of rejection that underlie the braggadocio."
        ]
    },
    {
        "areaOfFocus": "Borderline Personality Disorder",
        "longTermGoals": [
            "Develop and demonstrate skills to regulate emotional intensity and overreactivity, including anger management skills.",
            "Develop the ability to control impulsive behavior.",
            "Replace dichotomous thinking with the ability to tolerate ambiguity and complexity in relationships and situations.",
            "Learn and implement effective interpersonal skills and appropriately assertive communication strategies.",
            "Replace self damaging behaviors (such as substance abuse, reckless driving, sexual acting out, binge eating, or suicidal behaviors) with effective crisis management skills.",
            "Develop a stable sense of self through acquisition of values based behaviors to create a life worth living."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Discuss openly the history of cognitive, emotional, and behavioral difficulties that have led to seeking treatment.",
            "Address any history of substance use that may contribute to and/or complicate the treatment of borderline personality.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Cooperate with a medication evaluation by a prescriber and take medication, if prescribed.",
            "Verbalize a working understanding of dialectical behavior therapy (DBT), its structure, process, and therapeutic goals including the biosocial theory of the development of borderline personality disorder.",
            "Commit to work collaboratively with the therapist toward agreed upon therapeutic goals and to resist acting on life threatening, self harm urges.",
            "Verbalize any history of self harm and suicidal urges and behavior.",
            "Agree to initiate contact with the therapist or helpline if experiencing a strong urge to engage in self harmful behavior.",
            "Reduce life threatening and self harm behaviors.",
            "Reduce actions that interfere with participating in therapy.",
            "Reduce the frequency of maladaptive behaviors, thoughts, and feelings that interfere with attaining a reasonable quality of life.",
            "Participate in a group (preferably) or individual skills training course.",
            "Discuss previous or current posttraumatic stress.",
            "Identify, challenge, and replace biased, fearful self talk with reality based, positive self talk.",
            "Participate in imaginal and/or in vivo exposure to trauma related memories until talking or thinking about the trauma does not cause marked distress.",
            "Verbalize a sense of self respect that is not dependent on others' opinions.",
            "Engage in practices that help enhance a sustained sense of joy.",
            "Learn and apply problem solving skills to conflicts in daily life.",
            "Explore moment to moment interactions with the therapist to gain insight into self, others, and influences from one's developmental history.",
            "Explore and change self defeating beliefs and behaviors resulting from previous relationships and experiences.",
            "Learn and implement mentalization skills to improve personal and interpersonal relatedness."
        ]
    },
    {
        "areaOfFocus": "Childhood Trauma",
        "longTermGoals": [
            "Develop an awareness of how childhood issues have affected and continue to affect one's family life.",
            "Resolve past childhood/family issues, leading to less anger and depression, greater self esteem, security, and confidence.",
            "Release the emotions associated with past childhood/family issues, resulting in less resentment and more serenity.",
            "Let go of blame and begin to forgive others for pain caused in childhood."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe what it was like to grow up in the home environment.",
            "Acknowledge any dissociative phenomena that have resulted from childhood trauma.",
            "State the role substance abuse has in dealing with emotional pain of childhood.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Describe each family member and identify the role each played within the family.",
            "Identify patterns of abuse, neglect, or abandonment within the family of origin, both current and historical, nuclear, and extended.",
            "Identify feelings associated with major traumatic incidents in childhood and with parental child rearing patterns.",
            "Identify how own parenting has been influenced by childhood experiences.",
            "Enroll in dialectical behavior therapy.",
            "Enroll in treatment for posttraumatic stress.",
            "Implement relaxation techniques to counteract stress and anxiety surrounding the recall of childhood trauma.",
            "Decrease feelings of shame by being able to verbally affirm self as not responsible for abuse.",
            "Identify the positive aspects for self of being able to forgive all those involved with the abuse.",
            "Decrease statements of being a victim while increasing statements that reflect personal empowerment.",
            "Increase level of trust of others as shown by more socialization and greater intimacy tolerance."
        ]
    },
    {
        "areaOfFocus": "Chronic Pain",
        "longTermGoals": [
            "Acquire and utilize the necessary pain management skills.",
            "Regulate pain in order to maximize daily functioning and return to productive employment.",
            "Find relief from pain and build renewed contentment and joy in performing activities of everyday life.",
            "Find an escape route from the pain.",
            "Accept the chronic pain and move on with life as much as possible.",
            "Lessen daily suffering from pain."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe the nature, history, impact, and understood causes of chronic pain.",
            "Complete a thorough medical evaluation to rule out any alternative causes for the pain and reveal any new treatment possibilities.",
            "Disclose any history of substance use that may contribute to and complicate the treatment of chronic pain.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Follow through on a referral to a pain management or rehabilitation program.",
            "Complete a thorough medication evaluation and review by a prescriber who is a specialist in dealing with chronic pain or headache conditions.",
            "Participate in a cognitive behavioral group therapy for pain management.",
            "Verbalize an understanding of pain.",
            "Verbalize an understanding of the rationale for treatment.",
            "Identify and monitor specific pain triggers.",
            "Learn and implement calming skills such as relaxation, biofeedback, or mindfulness meditation to ease pain.",
            "Incorporate physical therapy into daily routine.",
            "Learn mental coping skills and implement with learned somatic skills for managing acute pain.",
            "Participate in acceptance and commitment therapy for chronic pain.",
            "Increase the level and range of activity by identifying and engaging in rewarding, value consistent activities.",
            "Incorporate physical exercise into daily routine.",
            "Use sleep hygiene practices to establish a reliable and restful sleep pattern.",
            "Identify, challenge, and change maladaptive thoughts and beliefs about pain and pain management and replace them with more adaptive thoughts and beliefs.",
            "Learn and implement specific coping skills including as well as when and how to use them to manage pain and its consequences.",
            "Recognize and attend to the positives in oneself and one's life as an alternative to selectively attending to depressing, negative thoughts about self and life.",
            "Integrate and implement all new mental, somatic, and behavioral strategies for managing pain.",
            "Implement relapse prevention strategies for managing future challenges.",
            "Make changes in diet that will promote health and fitness.",
            "Investigate the use of alternative therapies to pain management.",
            "Connect with social network sources who support the therapeutic changes.",
            "Explore the origins of pain experiences, their context, and possible relationships to current pain."
        ]
    },
    {
        "areaOfFocus": "Cognitive Deficits",
        "longTermGoals": [
            "Maintain effective functioning through the use of cognitive aids and strategies.",
            "Adjust activities and responsibilities to level of cognitive capacity, cooperating with others who provide assistance or oversight.",
            "Maintain physical and emotional health to maximize brain health and optimize cognitive performance.",
            "Experience satisfaction in life while managing cognitive symptoms and resulting lifestyle changes."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe the history, nature, and severity of cognitive problems experienced.",
            "Participate in a brief psychometric assessment to quantify cognitive and emotional functioning and to screen for alcohol abuse.",
            "Give the therapist permission to speak with others about the types and durations of cognitive problems, while developing a treatment plan.",
            "Cooperate with comprehensive evaluation procedures to assess cognition and factors affecting cognitive problems.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Client and/or family describes their understanding of the assessment results and recommendations.",
            "Agree to treatment of emotional disorders and/or substance dependence/abuse that may affect cognitive functioning.",
            "Consistently use written records and/or alarms to remind self of commitments and planned activities.",
            "Use computerized devices consistently to compensate for areas of cognitive weakness.",
            "Use internal or covert cognitive strategies to increase effective task performance.",
            "Use a systematic approach to problem solving.",
            "Link new recurring activities to existing recurring activities.",
            "Accept and implement environmental changes to enhance everyday performance.",
            "Participate in cognitive rehabilitation sessions and perform homework exercises.",
            "Challenge self to accomplish cognitively difficult tasks that have been identified as “safe” by health care professionals.",
            "Implement actions to enhance physical health.",
            "Problem solve with therapist around problems affecting adherence to treatment plan.",
            "Family members make adjustments to cope with the client's cognitive deficits.",
            "Client and family verbalize questions, anxiety, sadness, and other emotions triggered by this change in client's functioning.",
            "Express hope for the ability to experience satisfaction, love, and pleasure while managing the cognitive deficit.",
            "Participate in an evaluation of driving skills, accepting results and recommendations.",
            "Utilize public transportation, or accept transportation with family and friends.",
            "Consider the advice of professionals and others in selecting “safe” activities in which to invest one's time.",
            "Family and client implement restrictions in a way that preserves client's experience of choice, while reducing confrontation.",
            "Family members respond with empathy to the client's experience and allow the client to manage responsibilities and problems that are within his/her/their capacity.",
            "Seek reputable sources of information, advice, and support related to the underlying disease/injury.",
            "In consultation with an attorney, complete legal documents regarding proxy decision making and other legal issues.",
            "Verbalize an understanding of the Americans with Disabilities Act and ways to request accommodations in academic, work, or community settings.",
            "Identify and apply for benefits triggered by disability."
        ]
    },
    {
        "areaOfFocus": "Dependency",
        "longTermGoals": [
            "Develop confidence in capability of meeting own needs and of tolerating being alone.",
            "Achieve a healthy balance between independence and dependence.",
            "Decrease dependence on relationships while beginning to meet own needs, build confidence, and practice assertiveness.",
            "Break away permanently from any abusive relationships.",
            "Emancipate self from emotional and economic dependence on parents.",
            "Embrace the recovery model's emphasis on accepting responsibility for treatment decisions as well as the expectation of being able to live, work, and participate fully in the community."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe the style and pattern of emotional dependence in relationships.",
            "Verbalize an increased awareness of own dependency.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Verbalize insight into the automatic practice of striving to meet other people's expectations.",
            "List positive things about self.",
            "Identify and replace distorted automatic thoughts associated with assertiveness, being alone, or acting independently.",
            "Verbalize a decreased sensitivity to criticism.",
            "Increase saying no to others' requests.",
            "Report incidents of verbally stating own opinion.",
            "Identify own emotional and social needs and ways to fulfill them.",
            "Report examples of receiving favors from others without feeling the necessity of reciprocating.",
            "Verbalize an increased sense of self responsibility while decreasing sense of responsibility for others.",
            "Verbalize an increased awareness of boundaries and when they are violated.",
            "Increase the frequency of verbally clarifying boundaries with others.",
            "Increase the frequency of making decisions within a reasonable time and with self assurance.",
            "Participate in marital and/or family therapy.",
            "Attend an Al Anon group.",
            "Develop a plan to end the relationship with abusive partner and implement the plan with therapist's guidance."
        ]
    },
    {
        "areaOfFocus": "Depression—Unipolar",
        "longTermGoals": [
            "Alleviate depressive symptoms and return to previous level of effective functioning.",
            "Recognize, accept, and cope with feelings of depression.",
            "Develop healthy thinking patterns and beliefs about self, others, and the world that lead to the alleviation and help prevent the relapse of depression.",
            "Develop healthy interpersonal relationships that lead to the alleviation and help prevent the relapse of depression.",
            "Appropriately grieve the loss in order to normalize mood and to return to previously adaptive level of functioning."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe current and past experiences with depression including their impact on functioning and attempts to resolve it.",
            "Complete psychological testing to assess the depth of depression, the need for antidepressant medication, and suicide prevention measures.",
            "Verbalize any history of past and present suicidal thoughts and actions.",
            "State no longer having thoughts of self harm.",
            "Complete a medical evaluation to assess for possible contribution of medical or substance related conditions to the depression.",
            "Disclose any history of substance use that may contribute to and complicate the treatment of unipolar depression.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Cooperate with a medication evaluation by a prescriber.",
            "Verbalize an accurate understanding of depression.",
            "Verbalize an understanding of the rationale for treatment of depression.",
            "Identify and replace thoughts and beliefs that support depression.",
            "Learn and implement behavioral strategies to overcome depression.",
            "Identify important people in life, past and present, and describe the quality, good and poor, of those relationships.",
            "Verbalize an understanding and resolution of current interpersonal problems.",
            "Learn and implement problem solving and decision making skills.",
            "Learn and implement conflict resolution skills to resolve interpersonal problems.",
            "Learn and implement relapse prevention skills.",
            "Implement mindfulness techniques for relapse prevention.",
            "Participate in a therapy for grief to work through the loss(es) and restore reengagement in a meaningful life.",
            "Participate in couples therapy to decrease depression and improve the relationship.",
            "Verbalize an understanding of healthy and unhealthy emotions with the intent of increasing the use of healthy emotions to guide actions.",
            "Verbalize insight into how past relationships may be influencing current experiences with depression.",
            "Learn and use mindfulness and acceptance strategies to reduce avoidance and increase value based behavior.",
            "Read books on overcoming depression.",
            "Increasingly verbalize hopeful and positive statements regarding self, others, and the future."
        ]
    },
    {
        "areaOfFocus": "Dissociation",
        "longTermGoals": [
            "Integrate the various personalities.",
            "Reduce the frequency and duration of dissociative episodes.",
            "Resolve the emotional trauma that underlies the dissociative disturbance.",
            "Reduce the level of daily distress caused by dissociative disturbances.",
            "Regain full memory."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Identify each personality and have each one tell its story.",
            "Complete psychological testing designed to further understand the nature and extent of dissociative experiences and personality.",
            "Cooperate with a referral to a neurologist to rule out organic factors in amnestic episodes.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Complete a psychotropic medication evaluation with a prescriber.",
            "Take prescribed psychotropic medications responsibly at times ordered by the prescriber.",
            "Participate in a therapy to address personal and interpersonal vulnerabilities to dissociation.",
            "Identify the key issues that trigger a dissociative state.",
            "Decrease the number and duration of personality changes.",
            "Practice relaxation and deep breathing as means of reducing anxiety that serves as a trigger for dissociation.",
            "Identify, challenge, and replace self talk that produces negative emotional reactions with self talk that facilitates a better regulation of emotions.",
            "Verbalize acceptance of brief episodes of dissociation as not being the basis for panic but only as passing phenomena.",
            "Discuss the period preceding memory loss and the period after memory returns.",
            "Utilize photos and other memorabilia to stimulate recall of personal history."
        ]
    },
    {
        "areaOfFocus": "Eating Disorders and Obesity",
        "longTermGoals": [
            "Restore normal eating patterns, healthy weight maintenance, and a realistic appraisal of body size.",
            "Stabilize medical condition with balanced fluid and electrolytes, resuming patterns of food intake that will sustain life and gain weight to a normal level.",
            "Terminate the pattern of binge eating and purging behavior with a return to eating normal amounts of nutritious foods.",
            "Terminate overeating and implement lifestyle changes that lead to weight loss and improved health.",
            "Develop healthy cognitive patterns and beliefs about self that lead to positive identity and prevent a relapse of the eating disorder.",
            "Develop healthy interpersonal relationships that lead to alleviation and help prevent the relapse of the eating disorder.",
            "Develop coping strategies (e.g., feeling identification, problem solving, assertiveness) to address emotional issues that could lead to relapse of the eating disorder."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Honestly describe the pattern of eating including types, amounts, and frequency of food consumed or hoarded.",
            "Describe any regular use of unhealthy weight control behaviors.",
            "Complete psychological tests designed to assess and track eating patterns and unhealthy weight loss practices.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Cooperate with a complete medical evaluation.",
            "Cooperate with a nutritional evaluation.",
            "Cooperate with a dental exam.",
            "Cooperate with a medication evaluation by a prescriber and, if indicated, take medications as prescribed.",
            "Cooperate with admission to inpatient treatment, if indicated.",
            "Verbalize an accurate understanding of how eating disorders develop.",
            "Verbalize an understanding of the rationale and goals of treatment and commit to engagement in it.",
            "Keep a journal of food consumption.",
            "Establish regular eating patterns by eating at regular intervals and consuming optimal daily calories.",
            "Attain and maintain balanced fluids and electrolytes, as well as resumption of reproductive functions.",
            "Identify and develop a list of high risk situations for unhealthy eating or weight loss practices.",
            "Learn and implement skills for managing urges to engage in unhealthy eating or weight loss practices.",
            "Participate in exercises to build skills in managing urges to use maladaptive weight control practices.",
            "Identify, challenge, and replace self talk and beliefs that promote anorexia or bulimia.",
            "To begin to resolve bulimic behavior, identify important people in the past and present, and describe the quality, good and poor, of those relationships.",
            "Verbalize a resolution of current interpersonal problems and a resulting termination of bulimia.",
            "Parents and adolescent with anorexia agree to participate in all three phases of Family Based Treatment of anorexia.",
            "State a basis for positive identity that is not based on weight and appearance but on character, traits, relationships, and intrinsic value.",
            "Complete and maintain a behavioral weight loss program.",
            "Verbalize an understanding of relapse prevention and the distinction between a lapse and a relapse.",
            "Implement relapse prevention strategies for preventing and managing future lapses.",
            "Attend a support group to help maintain gains learned in therapy."
        ]
    },
    {
        "areaOfFocus": "Educational Deficits",
        "longTermGoals": [
            "Recognize the need for high school completion or GED certificate and enroll in the necessary courses to obtain it.",
            "Seek out vocational training to obtain marketable employment skill.",
            "Increase literacy skills.",
            "Overcome anxiety associated with learning.",
            "Establish the existence of a learning disability and begin the development of skills to overcome it."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Identify the factors that contributed to termination of education.",
            "Verbally verify the need for a high school diploma or GED.",
            "Complete an assessment to identify style of learning and to establish or rule out a specific learning disability.",
            "Complete a medical evaluation of health status.",
            "Cooperate with a psychological assessment for symptoms of another mental disorder that may affect or have affected educational achievement.",
            "Disclose any history of substance use that may contribute to and complicate the treatment of educational deficits.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Cooperate with a referral to a prescriber for a psychotropic medication evaluation.",
            "Implement the recommendations of evaluations.",
            "Identify the facts and feelings related to negative, critical education related experiences endured from parents, teachers, or peers.",
            "Verbalize decreased anxiety and negativity associated with learning situations.",
            "Identify own academic and vocational strengths.",
            "Identify the pros of educational achievement and the cons of a lack of education.",
            "Identify and replace negative thoughts regarding educational opportunities and ability level.",
            "Agree to pursue educational assistance to attain reading skills.",
            "State commitment to obtain further academic or vocational training.",
            "Make the necessary contacts to investigate enrollment in high school, GED, or vocational classes.",
            "Attend classes consistently to complete academic degree and/or vocational training course."
        ]
    },
    {
        "areaOfFocus": "Family Conflict",
        "longTermGoals": [
            "Parents increase their cooperation and mutual support in dealing with their children.",
            "Begin the process of emancipating from parents in a healthy way by making arrangements for independent living.",
            "Decrease the level of present conflict with parents while beginning to let go of or resolving past conflicts with them.",
            "Achieve a reasonable level of family connectedness and harmony where members support, help, and are concerned for each other.",
            "Become a reconstituted/blended family unit that is functional and whose members are bonded to each other.",
            "Reach a level of reduced tension, increased satisfaction, and improved communication with family and/or other authority figures."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe the conflicts and the causes of conflicts between self and parents.",
            "Attend and participate in family therapy sessions where the emphasis is on reducing conflict.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Identify own as well as others' role in the family conflicts.",
            "Family members demonstrate increased openness by sharing thoughts and feelings about family dynamics, roles, and expectations.",
            "Identify any role that chemical dependence behavior might play in triggering family conflict.",
            "Verbally describe an understanding of the role played by family relationship stress in triggering substance abuse or relapse.",
            "Increase the number of positive family interactions by planning activities.",
            "Parents report how both are involved in the home and parenting process.",
            "Identify ways in which the parental team can be strengthened.",
            "Parents learn and implement effective parenting methods to reduce conflict between themselves and the children over parenting.",
            "Older children and teens learn skills for managing anger and solving problems without conflict.",
            "Report an increase in resolving conflicts with parents by talking calmly and assertively rather than aggressively and defensively.",
            "Parents increase structure within the family.",
            "Each family member represents pictorially and then describes his/her/their role in the family.",
            "Family members report a desire for and vision of a new sense of connectedness.",
            "Identify factors that lead to dependence on the family and verbalize steps to overcome them.",
            "Increase the level of independent functioning."
        ]
    },
    {
        "areaOfFocus": "Female Sexual Dysfunction",
        "longTermGoals": [
            "Increase desire for and enjoyment of sexual activity.",
            "Attain and maintain physiological excitement response during sexual intercourse.",
            "Reach orgasm with a reasonable amount of time, intensity, and focus to sexual stimulation.",
            "Eliminate pain and achieve a presence of subjective pleasure before, during, and after sexual intercourse.",
            "Eliminate vaginal spasms that prohibit penile penetration during sexual intercourse and achieve a sense of relaxed enjoyment of coital pleasure."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Provide a detailed sexual history that explores current problems and past experiences that have influenced sexual attitudes, feelings, and behavior.",
            "Discuss any feelings of and causes for depression.",
            "Honestly report substance abuse and cooperate with recommendations by the therapist for addressing it.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Honestly and openly discuss the quality of the relationship including conflicts, unfulfilled needs, and anger.",
            "Cooperate with a physician's complete medical evaluation; discuss results with therapist.",
            "Cooperate with physician's recommendation for addressing a medical condition or medication that may be causing sexual problems.",
            "Verbalize an understanding of the role that physical disease or medication has on sexual dysfunction.",
            "Participate in a medication evaluation to explore medication that may be inhibiting sexual function as well as those that may enhance it.",
            "Participate in sex therapy with a partner or individually if the partner is not available.",
            "Participate in couples/marital therapy as part of addressing sexual problems.",
            "Demonstrate healthy acceptance and accurate knowledge of sexuality by freely learning and discussing accurate information regarding sexual functioning.",
            "State a willingness to explore new ways to approach sexual relations.",
            "List conditions and factors that positively affect sexual arousal such as setting, time of day, atmosphere.",
            "Identify and replace negative cognitive messages that trigger negative emotional reactions during sexual activity.",
            "Practice directed masturbation and sensate focus exercises alone and with partner and share feelings associated with activity.",
            "Report progress on graduated self controlled vaginal penetration with a partner.",
            "Learn and practice mindfulness meditation and apply to sexual situations.",
            "State an understanding of how family upbringing, including religious training, negatively influenced sexual thoughts, feelings, and behavior.",
            "Verbalize a resolution of feelings regarding sexual trauma or abuse experiences.",
            "Verbalize an understanding of the influence of childhood sex role models.",
            "Verbalize connection between previously failed intimate relationships and current fear.",
            "Discuss feelings surrounding a secret affair and make a termination decision regarding one of the relationships.",
            "Openly acknowledge and discuss the match between sexual orientation and sexual partner(s).",
            "Discuss low self esteem issues that impede sexual functioning and verbalize a positive self image.",
            "Communicate feelings of threat to partner that are based on perception of partner being too sexually critical, judgmental, or overly aggressive.",
            "Verbalize a positive body image.",
            "Implement new coital positions and settings for sexual activity that enhance pleasure and satisfaction.",
            "Engage in more assertive behaviors that allow for sharing sexual needs, feelings, and desires, behaving more sensuously and expressing pleasure.",
            "Resolve conflicts or develop coping strategies that reduce stress interfering with sexual interest or performance.",
            "Verbalize increasing desire for and pleasure with sexual activity."
        ]
    },
    {
        "areaOfFocus": "Financial Stress",
        "longTermGoals": [
            "Revise spending patterns to not exceed income.",
            "Resolve financial crisis with a path to eliminate debt.",
            "Gain a new sense of self worth in which one's value is not attached to the capacity to do things or own things that cost money.",
            "Understand personal desires, insecurities, and anxieties that make overspending possible.",
            "Achieve an inner strength to control personal impulses, cravings, and desires that directly or indirectly increase debt irresponsibly."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe the details of the current financial situation.",
            "Isolate the sources and causes of the excessive indebtedness.",
            "Verbalize feelings of depression, hopelessness, and/or shame that are related to financial status.",
            "Describe any suicidal impulses that may accompany financial stress.",
            "Identify personal traits that make undisciplined spending possible.",
            "Honestly describe any of own or family members' substance abuse problems that contribute to financial irresponsibility.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Identify priorities that should control how money is spent.",
            "Describe the family of origin pattern of money management.",
            "Meet with community agency personnel to apply for public assistance.",
            "Write a budget that balances income with expenses.",
            "Attend a meeting with a credit counselor to gain assistance in budgeting and contacting creditors for establishment of a reasonable repayment plan.",
            "Meet with an attorney to help reach a decision regarding filing for bankruptcy.",
            "Verbalize a plan for seeking employment to raise level of income.",
            "Set financial goals and make budgetary decisions with partner, allowing for equal input and balanced control over financial matters.",
            "Keep weekly and monthly records of financial income and expenses.",
            "Use cognitive and behavioral strategies to control the impulse to make unnecessary and unaffordable purchases.",
            "Report instances of successful control over impulse to spend on unnecessary expenses."
        ]
    },
    {
        "areaOfFocus": "Grief/Loss Unresolved",
        "longTermGoals": [
            "Begin a healthy grieving process around the loss.",
            "Develop an awareness of how the avoidance of grieving has affected life and begin the healing process.",
            "Complete the process of letting go of the lost significant other.",
            "Resolve the loss, reengaging in old relationships and initiating new contacts with others."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Tell in detail the story of the current loss that is triggering symptoms.",
            "Participate in a therapy that addresses issues beyond grief that have arisen as a result of the loss.",
            "Identify how the use of substances has aided the avoidance of feelings associated with the loss.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Read books on the topic of grief to better understand the loss experience and to increase a sense of hope.",
            "Identify what goals in the process of grief resolution have been accomplished thus far.",
            "Watch videos on the theme of grief and loss to compare own experience with that of the characters in the films.",
            "Begin verbalizing feelings associated with the loss.",
            "Attend a grief/loss support group.",
            "Identify how avoiding dealing with loss has negatively affected life.",
            "Acknowledge dependency on lost loved one and begin to refocus life on independent actions to meet emotional needs.",
            "Verbalize and resolve feelings of anger or guilt focused on self or deceased loved one that interfere with the grieving process.",
            "Verbalize resolution of feelings of guilt and regret associated with the loss.",
            "Decrease unrealistic thoughts, statements, and feelings of being responsible for the loss.",
            "Express thoughts and feelings about the deceased that went unexpressed while the deceased was alive.",
            "Identify and verbalize positives about the deceased loved one including previous positive experiences, positive characteristics, positive aspects of the relationship, and how these things may be remembered.",
            "Attend and participate in a family therapy session focused on each member sharing his/her/their experience with grief.",
            "Reengage in activities with family, friends, coworkers, and others.",
            "Report decreased time spent each day focusing on the loss.",
            "Participate in grieving rituals that allow for open sharing of feelings and receiving of support from friends and family.",
            "Implement acts of spiritual faith as a source of comfort and hope."
        ]
    },
    {
        "areaOfFocus": "Impulse Control Disorder",
        "longTermGoals": [
            "Reduce the frequency of impulsive behavior and increase the frequency of behavior that is carefully thought out.",
            "Reduce the frequency of verbal or physical aggression.",
            "Reduce thoughts that trigger impulsive behavior and increase self talk that controls behavior.",
            "Learn to stop, listen, and think before acting."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Identify the impulsive behaviors that have been engaged in over the last 6 months.",
            "List the reasons or rewards that lead to continuation of an impulsive pattern.",
            "Disclose any history of substance use that may contribute to and complicate the treatment of Impulse Control Disorder.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "List the negative consequences that accrue to self and others as a result of impulsive behavior.",
            "Identify impulsive behavior's antecedents, mediators, and consequences.",
            "Participate in imaginal exposure sessions to decrease the urge to act impulsively.",
            "Participate in an in vivo exposure treatment procedure.",
            "Verbalize a clear connection between impulsive behavior and negative consequences to self and others.",
            "Before acting on behavioral decisions, frequently review them with a trusted friend or family member for feedback regarding possible consequences.",
            "Utilize cognitive methods to control trigger thoughts and reduce impulsive reactions to those trigger thoughts.",
            "Use relaxation exercises to control anxiety, urges, and reduce consequent impulsive behavior.",
            "Utilize behavioral strategies to manage urges for impulsive action.",
            "List instances where “stop, listen, think, and act” has been implemented, citing the positive consequences.",
            "Describe any history of manic or hypomanic behavior related to a mood disorder.",
            "Identify situations in which there has been a loss of control over aggressive impulses resulting in destructive or assaultive behavior.",
            "Comply with the recommendations from a prescriber evaluation regarding the necessity for psychopharmacological intervention.",
            "Implement a reward system for replacing impulsive actions with reflection on consequences and choosing wise alternatives.",
            "Learn and implement problem solving skills to reduce impulsive behavior.",
            "Read recommended material on overcoming impulsive behavior.",
            "Attend a self help recovery group."
        ]
    },
    {
        "areaOfFocus": "Intimate Relationship Conflicts",
        "longTermGoals": [
            "Develop the necessary skills for effective, open communication, mutually satisfying sexual intimacy, and enjoyable time for companionship within the relationship.",
            "Increase awareness of own role in the relationship conflicts.",
            "Learn to identify escalating behaviors that lead to abuse.",
            "Make a commitment to one intimate relationship at a time.",
            "Accept the termination of the relationship.",
            "Rebuild positive self image after acceptance of the rejection associated with the broken relationship."
        ],
        "shortTermObjectives": [
            "Attend and actively participate in conjoint sessions with the partner.",
            "Identify problems and strengths in the relationship, including one's own role in each.",
            "Acknowledge the connection between substance abuse and the conflicts present within the relationship.",
            "Chemically dependent partner agrees to pursue substance treatment individually or with partner.",
            "Complete psychological testing designed to assess the marital relationship and track treatment progress.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Make a commitment to change specific behaviors that have been identified by self or the partner.",
            "Each partner negotiates and signs a contract to agree to increase positive behaviors that each partner desires.",
            "Increase the frequency of the direct expression of honest, respectful, and positive feelings and thoughts within the relationship.",
            "Learn and implement problem solving and conflict resolution skills.",
            "Learn and implement cognitive therapy techniques to replace unrealistic, maladaptive thoughts, feelings, and actions with those facilitative of the relationship.",
            "Accept partner's existing characteristics that are unlikely to change but do not jeopardize the relationship.",
            "Increase flexibility of expectations, willingness to compromise, and acceptance of irreconcilable differences.",
            "Understand the origin of each other's negative emotions and reactions and develop more constructive interactions that fill needs.",
            "Gain insight into how past relationship experiences influence current relationship problems.",
            "Identify any patterns of destructive and/or abusive behavior in the relationship.",
            "Implement a “time out” signal that either partner may give to stop interaction that may escalate into abuse.",
            "Initiate verbal and physical affection behaviors toward the partner.",
            "Increase time spent in enjoyable contact with the partner.",
            "Participate in an evaluation to identify or rule out sexual dysfunction and participate in appropriate treatment, if indicated.",
            "Commit to the establishment of healthy, mutually satisfying sexual attitudes and behavior that is not a reflection of destructive earlier experiences.",
            "Identify the cause and consequences of the partner's infidelity, as well as each other's goals of therapy.",
            "Verbalize acceptance of the loss of the relationship.",
            "Implement increased socialization activities to cope with loneliness."
        ]
    },
    {
        "areaOfFocus": "Legal Conflicts",
        "longTermGoals": [
            "Accept and responsibly respond to the mandates of court.",
            "Understand how chemical dependence has contributed to legal problems and accept the need for recovery.",
            "Accept responsibility for decisions and actions that have led to arrests and develop higher moral and ethical standards to govern behavior.",
            "Internalize the need for treatment so as to change values, thoughts, feelings, and behavior to a more prosocial position.",
            "Become a responsible citizen in good standing within the community."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe the behavior that led to current involvement with the court system.",
            "Verbalize the role drug and/or alcohol abuse has played in legal problems.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Maintain sobriety in accordance with rules of probation/parole.",
            "Obtain counsel and meet to make plans for resolving legal conflicts.",
            "Make regular contact with court officers to fulfill sentencing requirements.",
            "Verbalize and accept responsibility for the series of decisions and actions that eventually led to illegal activity.",
            "State values that affirm behavior within the boundaries of the law.",
            "Verbalize how the emotional state of anger, frustration, helplessness, or depression has contributed to illegal behavior.",
            "Identify the causes for the negative emotional state that was associated with illegal actions.",
            "Identify and replace cognitive distortions that foster antisocial behavior.",
            "Attend an anger control group.",
            "Identify ways to meet life needs (i.e., social and financial) without resorting to illegal activities.",
            "Attend class to learn how to successfully seek employment.",
            "Verbalize an understanding of the importance of honesty in earning the trust of others and esteem for self.",
            "Develop and implement a plan for restitution for illegal activity."
        ]
    },
    {
        "areaOfFocus": "Loneliness",
        "longTermGoals": [
            "Reduce overall frequency and intensity of loneliness.",
            "Reduce the level of isolation while increasing social engagement.",
            "Resolve the core fear that prevents social outreach.",
            "Become more engaged with social contact through community involvement (e.g., volunteering at nonprofit agency, finding employment, involvement in a church group or art class, etc.).",
            "Build a structured schedule into the daily routine that includes meals, sleeping, exercise, and out of home activities."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe the feelings of loneliness, the circumstances that trigger these feelings, and the results of isolation.",
            "Describe the history of social interaction and the feelings associated with that interaction.",
            "Complete psychological tests designed to assess the nature and severity of social anxiety and avoidance.",
            "Complete a medical evaluation to assess for possible contribution of medical or substance related conditions to social anxiety and avoidance.",
            "Complete a medication evaluation to assess whether use of psychotropic medication may be useful in the treatment plan.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Identify perceived causes for avoidance of social contacts.",
            "Verbalize an understanding of the rationale for cognitive behavioral treatment of social anxiety.",
            "Learn and implement calming and coping strategies to manage anxiety symptoms during moments of social anxiety and lead to a more relaxed state in general.",
            "Identify, challenge, and replace biased, fearful self talk with reality based, positive self talk.",
            "Participate in gradual repeated exposure to feared social situations within and outside of therapy.",
            "Identify and engage in pleasant social activities on a daily basis.",
            "Learn and implement personal and interpersonal skills to reduce anxiety and improve interpersonal relationships.",
            "Learn to accept limitations in life and commit to tolerating, rather than avoiding, unpleasant emotions while accomplishing meaningful goals.",
            "Identify feelings associated with distrust of others that lead to avoidance of socialization.",
            "Acknowledge that the belief about others being threatening is based more on subjective interpretation than on objective data.",
            "Explore past experiences that may be the source of low self esteem and social anxiety currently.",
            "Work through developmental conflicts that may be influencing current struggles with fear and avoidance and take appropriate actions.",
            "Verbally describe the defense mechanisms used to avoid close relationships.",
            "Maintain involvement in work, family, and social activities.",
            "Reestablish a consistent sleep wake cycle.",
            "Create and implement a schedule of daily living activities.",
            "Share the saddening effects of the death of a loved one.",
            "Identify positive traits about self."
        ]
    },
    {
        "areaOfFocus": "Low Self-Esteem",
        "longTermGoals": [
            "Elevate self esteem.",
            "Develop a consistent, positive self image.",
            "Demonstrate improved self esteem through more pride in appearance, more assertiveness, greater eye contact, and identification of positive traits in self talk messages.",
            "Establish an inward sense of self worth, confidence, and competence.",
            "Interact socially without undue distress or disability."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Acknowledge feeling less competent than most others and discuss its perceived basis.",
            "Disclose any history of substance use.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Increase insight into the historical and current sources of low self esteem.",
            "Decrease the frequency of negative self descriptive statements and increase frequency of positive self descriptive statements.",
            "Identify and replace negative self talk messages used to reinforce low self esteem.",
            "Identify any secondary gain that is received by speaking negatively about self and refusing to take any risks.",
            "Decrease the verbalized fear of rejection while increasing statements of self acceptance.",
            "Identify and engage in activities that would improve self image by being consistent with one's values.",
            "Increase eye contact and interaction with others.",
            "Take responsibility for daily grooming and personal hygiene.",
            "Identify positive traits and talents about self.",
            "Demonstrate an increased ability to identify and express personal feelings.",
            "Articulate a plan to be proactive in trying to get identified needs met.",
            "Positively acknowledge verbal compliments from others.",
            "Increase the frequency of assertive behaviors.",
            "Form realistic, appropriate, and attainable goals for self in all areas of life.",
            "Take verbal responsibility for accomplishments without discounting."
        ]
    },
    {
        "areaOfFocus": "Male Sexual Dysfunction",
        "longTermGoals": [
            "Increase desire for and enjoyment of sexual activity.",
            "Attain and maintain physiological excitement response during sexual intercourse.",
            "Reach ejaculation with a reasonable amount of time, intensity, and focus to sexual stimulation.",
            "Eliminate pain and achieve a presence of subjective pleasure before, during, and after sexual intercourse."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Provide a detailed sexual history that explores current problems and past experiences that have influenced sexual attitudes, feelings, and behavior.",
            "Report any signs of depression; participate in treatment of depressive feelings that may be causing sexual difficulties.",
            "Honestly report substance abuse and cooperate with recommendations by the therapist for addressing it.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Honestly and openly discuss the quality of the relationship including conflicts, unfulfilled needs, and anger.",
            "Cooperate with a physician's complete examination and follow through on any treatment recommendations.",
            "Verbalize an understanding of the role that physical disease or medication has on sexual dysfunction.",
            "Take medication for erectile dysfunction as ordered and report as to effectiveness and side effects.",
            "Participate in sex therapy with a partner or individually if the partner is not available.",
            "Verbalize an understanding of normal sexual functioning and contributors to sexual dysfunction.",
            "Demonstrate healthy acceptance by freely discussing accurate knowledge of sexual functioning.",
            "Discuss low self esteem issues that impede sexual functioning and verbalize a positive self image.",
            "Identify challenge, and replace self defeating thoughts and beliefs with positive, reality based thoughts and beliefs.",
            "List conditions and factors that positively affect sexual arousal, such as setting, time of day, or atmosphere.",
            "Practice directed masturbation and sensate focus exercises alone and with partner and share feelings associated with activity.",
            "Participate in graduated exposure (desensitization) to sexual exercises that have gradually increasing anxiety attached to them.",
            "Engage in more assertive behaviors that allow for sharing sexual needs, feelings, and desires, behaving more sensuously, and expressing pleasure.",
            "Implement new coital positions and settings for sexual activity that enhance pleasure and satisfaction.",
            "Male partner implement masturbation prior to intercourse and/or the squeeze technique during sexual intercourse and report on success in slowing premature ejaculation.",
            "Verbalize a positive body image.",
            "State an understanding of how religious training negatively influenced sexual thoughts, feelings, and behavior.",
            "Communicate feelings of threat to partner that are based on perception of partner being too sexually aggressive or too critical.",
            "Verbalize a resolution of feelings regarding sexual trauma or abuse experiences.",
            "Verbalize an understanding of the influence of childhood sex role models.",
            "Verbalize connection between previously failed intimate relationships and current fear.",
            "Discuss feelings surrounding a secret affair and make a termination decision regarding one of the relationships.",
            "Openly acknowledge and discuss sexual orientation.",
            "Resolve conflicts or develop coping strategies that reduce stress interfering with sexual interest or performance."
        ]
    },
    {
        "areaOfFocus": "Medical Issues",
        "longTermGoals": [
            "Medically stabilize physical condition.",
            "Work through the grieving process and face with peace the reality of own death.",
            "Accept emotional support from those who care, without pushing them away in anger.",
            "Live life to the fullest extent possible, even though remaining time may be limited.",
            "Cooperate with the medical treatment regimen without passive aggressive or active resistance.",
            "Become as knowledgeable as possible about the diagnosed condition and about living as normally as possible.",
            "Reduce fear, anxiety, and worry associated with the medical condition.",
            "Accept the illness, and adapt life to the necessary limitations.",
            "Accept the role of psychological or behavioral factors in development of the medical condition and focus on resolution of these factors."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe history, symptoms, and treatment of the medical condition.",
            "Disclose any history of or current involvement with substance abuse.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Identify feelings associated with the medical condition.",
            "Family members share with each other feelings that are triggered by the client's medical condition.",
            "Identify the losses or limitations that have been experienced due to the medical condition.",
            "Verbalize an increased understanding of the steps to grieving the losses brought on by the medical condition.",
            "Verbalize acceptance of the reality of the medical condition and the need for treatment.",
            "Commit to learning and implementing a proactive approach to managing the challenges introduced by the medical condition/diagnosis.",
            "Journal thoughts, feelings, actions, and circumstances related to stressful reactions.",
            "Verbalize an understanding of the medical condition/diagnosis and managing the stress it can create.",
            "Work with therapist to develop a plan for coping with stress.",
            "Learn and implement skills for managing stress.",
            "Demonstrate mastery of coping skills by applying them to daily life situations.",
            "Learn and implement skills for preventing lapses back into more maladaptive coping.",
            "Share with significant others efforts to adapt successfully to the medical condition/diagnosis.",
            "Comply with the medication regimen and necessary medical procedures, reporting any side effects or problems to physicians or therapists.",
            "Engage in social, productive, and recreational activities that are possible despite the medical condition.",
            "Engage in faith based activities as a source of comfort and hope.",
            "Attend a support group of others diagnosed with a similar illness.",
            "Partner and family members attend a support group.",
            "Implement positive imagery as a means of triggering peace of mind and reducing tension.",
            "Identify the coping skills and sources of emotional support that have been beneficial in the past.",
            "Client's partner and family members verbalize their fears regarding the client's severely disabled life or possible death.",
            "Acknowledge any high risk behaviors associated with sexually transmitted disease (STD).",
            "Accept the presence of an STD or HIV and follow through with medical treatment.",
            "Identify sources of emotional distress that could have a negative impact on physical health."
        ]
    },
    {
        "areaOfFocus": "Obsessive-Compulsive and Related Disorders",
        "longTermGoals": [
            "Reduce the frequency, intensity, and duration of obsessions and/or compulsions.",
            "Reduce time involved with or interference from obsessions and compulsions.",
            "Function daily at a consistent level with minimal interference from obsessions and compulsions.",
            "Resolve key life conflicts and the emotional stress that fuels obsessive compulsive behavior patterns.",
            "Resolve distorted perceptions about his/her physical appearance that lead to unreasonable self criticism and repetitive behaviors.",
            "Accept the presence of obsessive thoughts without acting on them and commit to a value driven life."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe the history and nature of obsessions and compulsions.",
            "Obtain a complete medical evaluation to rule out medical and substance induced causes for OCD or related symptoms.",
            "Complete psychological tests designed to assess and track the nature and severity of obsessions and compulsions.",
            "Disclose any history of substance use that may contribute to and complicate the treatment of OCD.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Cooperate with an evaluation by a medication prescriber for psychotropic medication.",
            "Keep a daily journal of obsessions, compulsions, and triggers; record thoughts, feelings, and actions taken.",
            "Verbalize an accurate understanding of OCD or related disorder, how it develops, and how it is maintained.",
            "Verbalize an understanding of the treatment rationale for OCD.",
            "Identify and replace fearful self talk and beliefs.",
            "Participate in imaginal or in vivo exposure to feared internal and/or external cues.",
            "Participate in acceptance and commitment therapy (ACT) for OCD.",
            "Verbalize an understanding of relapse prevention.",
            "Identify situations at risk for a lapse and strategies for managing these risk situations.",
            "Implement a refocusing cognition or behavior or an interruption via an unpleasant task to reduce the frequency and intensity of OCD thoughts and behaviors.",
            "Implement series of small steps toward breaking the hoarding pattern while sharing feelings and thoughts about the process.",
            "Identify and discuss unresolved life conflicts.",
            "Verbalize and clarify feelings connected to key life conflicts.",
            "Accept or work to resolve identified life conflicts.",
            "Gain insight into how childhood experiences might influence current struggles with OCD and take appropriate actions.",
            "Interpret feared obsessions in a less threatening way.",
            "Engage in a strategic ordeal to overcome OCD impulses.",
            "Develop and implement a daily ritual that interrupts the current pattern of compulsions."
        ]
    },
    {
        "areaOfFocus": "Opioid Use Disorder",
        "longTermGoals": [
            "Accept the powerlessness and unmanageability over opioids and participate in a recovery based program.",
            "Withdraw from mood altering substance, stabilize physically and emotionally, and then establish a supportive recovery plan.",
            "Establish a sustained recovery, free from the use of all mood altering substances.",
            "Establish and maintain total abstinence while increasing knowledge of the disease and the process of recovery.",
            "Acquire the necessary skills to maintain long term abstinence from all mood altering substances and live a life free of chemicals."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allows.",
            "Cooperate with medical assessment and an evaluation of the necessity for pharmacological intervention.",
            "Take prescribed medications as directed by the prescriber.",
            "Report acute withdrawal symptoms to the treatment staff.",
            "Complete psychological testing or objective questionnaires for assessing opioid use.",
            "Provide honest and complete information for a chemical dependence biopsychosocial history.",
            "Attend didactic sessions and read assigned material in order to increase knowledge of addiction and the process of recovery.",
            "Attend group therapy sessions to share thoughts and feelings associated with, reasons for, consequences of, feelings about, and alternatives to addiction.",
            "Verbalize an increased knowledge and understanding of the concept of a higher power.",
            "List and discuss negative consequences resulting from or exacerbated by substance dependence.",
            "Verbalize recognition that mood altering chemicals were used as the primary coping mechanism to escape from stress or pain and resulted in negative consequences.",
            "List and discuss the negative emotions that were caused by or exacerbated by substance dependence.",
            "List and discuss reasons to work on a plan for recovery from addiction.",
            "Explore lies used to hide substance dependence.",
            "Verbalize ways a higher power can assist in recovery.",
            "Explore and resolve ambivalence associated with commitment to treatment.",
            "Identify realistic goals for substance abuse recovery.",
            "Verbalize a commitment to abstain from the use of mood altering drugs.",
            "Identify and make changes in social relationships that will support recovery.",
            "Identify projects and other social and recreational activities that sobriety will now afford and that will support sobriety.",
            "Verbalize how the living situation contributes to substance use and acts as a hindrance to recovery.",
            "Make arrangements to terminate current living situation and move to a place more conducive to recovery.",
            "Identify the positive impact that sobriety will have on intimate and family relationships.",
            "Agree to make amends to significant others who have been hurt by the life dominated by substance abuse.",
            "Participate in behavioral marital or family therapy to learn and implement ways to improve relations and communicate effectively.",
            "Learn and implement personal coping strategies to manage urges to lapse back into chemical use.",
            "Identify, challenge, and replace destructive self talk with positive, strength building self talk.",
            "Participate in gradual repeated exposure to triggers of urges to lapse back into chemical substance use.",
            "Learn and implement personal skills to manage common day to day challenges and build confidence in managing them without the use of substances.",
            "Learn and implement pain management techniques as an alternative to coping through opioid use.",
            "Implement relapse prevention strategies for managing possible future situations with high risk for relapse.",
            "Structure time and increase self esteem by obtaining employment.",
            "Verbalize options to substance use in dealing with stress and in finding pleasure or excitement in life.",
            "Verbalize the results of turning problems over to God each day."
        ]
    },
    {
        "areaOfFocus": "Panic/Agoraphobia",
        "longTermGoals": [
            "Reduce the frequency, intensity, and duration of panic attacks.",
            "Reduce the fear that panic symptoms will recur without the ability to manage them.",
            "Reduce the fear of triggering panic and eliminate avoidance of activities and environments thought to trigger panic.",
            "Increase comfort in freely leaving home and being in a public environment.",
            "Learn to accept occasional panic symptoms and fearful thoughts without it affecting actions."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe the history and nature of the panic symptoms.",
            "Obtain a complete medical evaluation to rule out medical and substance induced causes for obsessive compulsive disorder (OCD) or related symptoms.",
            "Complete psychological tests designed to assess the depth and breadth of fear and avoidance.",
            "Disclose any history of substance use that may contribute to and complicate the treatment of panic or agoraphobia.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Cooperate with an evaluation by a medication prescriber for psychotropic medication.",
            "Take prescribed psychotropic medications as prescribed.",
            "Complete a daily journal of experiences with panic and agoraphobia.",
            "Verbalize an accurate understanding of panic attacks and agoraphobia and their treatment.",
            "Verbalize an understanding of the rationale for treatment of panic.",
            "Implement calming and coping strategies to reduce overall anxiety and to cope with the experience of panic.",
            "Identify, challenge, and replace biased, fearful self talk with reality based, positive self talk.",
            "Participate in gradual exposure to feared physical sensations until they are no longer frightening to experience.",
            "Undergo gradual repeated exposure to feared or avoided situations.",
            "Implement relapse prevention strategies for managing possible future anxiety symptoms.",
            "Participate in acceptance and commitment therapy (ACT) for panic disorder.",
            "Participate in an exercise program as part of the overall therapy approach.",
            "Work through developmental conflicts that may be influencing current struggles with fear and avoidance and take appropriate actions.",
            "Identify and discuss unresolved life conflicts.",
            "Verbalize and clarify feelings connected to key life conflicts.",
            "Accept or work to resolve identified life conflicts.",
            "Implement the Eriksonian task designed to face fear.",
            "Commit self to not allowing the threat of panic symptoms to control decisions in life; take actions based on personal goals rather than fear and avoidance."
        ]
    },
    {
        "areaOfFocus": "Paranoid Ideation",
        "longTermGoals": [
            "Show more trust in others by speaking positively of them and reporting comfort in socializing.",
            "Interact with others without defensiveness or anger.",
            "Verbalize trust of significant other and eliminate accusations of disloyalty.",
            "Report reduced vigilance and suspicion around others as well as more relaxed, trusting, and open interaction.",
            "Concentrate on important matters without interference from suspicious obsessions.",
            "Function appropriately at work, in social activities, and in the community with only minimal interference from distrustful obsessions."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Identify those people or agencies that are distrusted and why.",
            "Complete a psychological evaluation to assess the depth of paranoia.",
            "Disclose any history of substance use that may contribute to and complicate the treatment of paranoid ideation.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Comply with a medical evaluation to assess medical health.",
            "Comply with a psychiatric evaluation and take psychotropic medication as prescribed.",
            "Participate in a comprehensive rehabilitation program for the presenting problem.",
            "Identify feelings associated with the distrust.",
            "Identify core belief that others are untrustworthy and malicious.",
            "Explore the positive and negative impact of beliefs that others are untrustworthy and malicious.",
            "Acknowledge other feelings that may underlie distrust of others.",
            "Acknowledge that the belief about others being threatening is based more on subjective interpretation than on objective data.",
            "Verbalize trust in significant other and feel relaxed when not in his/her/their presence.",
            "Learn and implement skills that facilitate increased satisfying social interaction without fear or suspicion."
        ]
    },
    {
        "areaOfFocus": "Parenting",
        "longTermGoals": [
            "Achieve a level of competent, effective parenting.",
            "Effectively manage challenging problem behavior of the child.",
            "Reach a realistic view and approach to parenting, given the child's developmental level.",
            "Terminate ineffective and/or abusive parenting and implement positive, effective techniques.",
            "Strengthen the parental team by resolving marital conflicts.",
            "Achieve a greater level of family connectedness."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Identify major concerns regarding the child's behavior and the associated parenting approaches that have been tried.",
            "Describe any conflicts that result from the different approaches to parenting that each partner has.",
            "Parents and child cooperate with psychological testing designed to enhance understanding of the family.",
            "Disclose any significant marital conflicts and work toward their resolution.",
            "Disclose any history of substance use that may contribute to and complicate the treatment of parenting issues.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Cooperate with a medication evaluation for possible use of psychotropic medications as part of the treatment plan and with good adherence to the prescription, if prescribed.",
            "Freely express feelings of frustration, helplessness, and inadequacy that each experiences in the parenting role.",
            "Verbalize a commitment to learning and using alternative ways to think about and manage anger and misbehavior.",
            "Verbalize an understanding of the numerous key differences between boys and girls at different levels of development and adjust expectations and parenting practices accordingly.",
            "Verbalize an increased awareness and understanding of the unique issues and trials of parenting adolescents.",
            "Verbalize an understanding of the impact of parental reactions on their child's behavior.",
            "Learn and implement parenting practices that have demonstrated effectiveness.",
            "Interact with children under the supervision of the therapist to improve parenting knowledge and skills and the quality of parent child interactions.",
            "Verbalize a sense of increased skill, effectiveness, and confidence in parenting.",
            "Older children and adolescents learn and implement skills for managing self and interactions with others.",
            "Develop skills to talk openly and effectively with the children.",
            "Partners express verbal support of each other in the parenting process.",
            "Decrease outside pressures, demands, and distractions that drain energy and time from the family.",
            "Increase the gradual letting go of their adolescent in constructive, affirmative ways.",
            "Parents and child report an increased feeling of connectedness between them.",
            "Verbalize an understanding of relapse prevention and the difference between a lapse and a relapse.",
            "Learn and implement strategies to prevent relapse of disruptive behavior."
        ]
    },
    {
        "areaOfFocus": "Phase of Life Problems",
        "longTermGoals": [
            "Resolve conflicted feelings and adapt to the new life circumstances.",
            "Reorient life view to recognize the advantages of the current situation.",
            "Find satisfaction in serving, nurturing, and supporting significant others who are dependent and needy.",
            "Balance life activities between consideration of others and development of own interests."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe the circumstances of life that are contributing to stress, anxiety, or lack of fulfillment.",
            "Disclose any history of substance use that may contribute to and complicate the treatment of phase of life problems.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Identify values that guide life's decisions and determine fulfillment.",
            "Implement new activities that increase a sense of satisfaction.",
            "Identify and implement changes that will reduce feelings of being overwhelmed by caretaking responsibilities.",
            "Implement increased assertiveness to take control of conflicts.",
            "Apply problem solving skills to current circumstances.",
            "Increase communication with significant others regarding current life stress factors.",
            "Identify five advantages of current life situation.",
            "Implement changes in time and effort allocation to restore balance to life.",
            "Increase activities that reinforce a positive self identity.",
            "Increase social contacts to reduce sense of isolation.",
            "Share emotional struggles related to current adjustment stress.",
            "Significant others offer support to reduce the client's stress.",
            "Read self help book on the difficult transition life is presenting currently."
        ]
    },
    {
        "areaOfFocus": "Phobia",
        "longTermGoals": [
            "Reduce fear of the specific phobic object or situation.",
            "Reduce avoidance of the specific phobic object or situation, leading to comfort and independence in moving around in a public environment.",
            "Eliminate fear of the specific phobic object or situation.",
            "Eliminate avoidance of the specific phobic object or situation, leading to comfort and independence in moving around in a public environment."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe the history and nature of the phobia(s), complete with impact on functioning and attempts to overcome it.",
            "Complete psychological tests designed to assess features of the phobia.",
            "Participate in a behavioral assessment task.",
            "Disclose any history of substance use that may contribute to and complicate the treatment of the phobia.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Cooperate with an evaluation by a prescriber for psychotropic medication.",
            "Verbalize an accurate understanding of information about phobias and their treatment.",
            "Verbalize an understanding of the cognitive, physiological, and behavioral components of anxiety and its treatment.",
            "Learn and implement calming skills to reduce and manage anxiety symptoms that may emerge during encounters with phobic objects or situations.",
            "Learn and implement applied muscle tension skills.",
            "Identify, challenge, and replace biased, fearful self talk with positive, realistic, and empowering self talk.",
            "Participate in imaginal/virtual reality/live exposure exercises to feared or avoided phobic objects or situations.",
            "Implement relapse prevention strategies for preventing and/or managing possible future anxiety symptoms.",
            "Learn to accept anxious thinking and tolerate, rather than avoid, unpleasant emotions while accomplishing meaningful goals.",
            "Verbalize the costs and benefits of remaining fearful and avoidant.",
            "Verbalize the separate realities of the irrationally feared object or situation and the emotionally painful experience from the past that has been evoked by the phobic stimulus."
        ]
    },
    {
        "areaOfFocus": "Posttraumatic Stress Disorder (PTSD)",
        "longTermGoals": [
            "Eliminate or reduce the negative impact trauma related symptoms have on social, occupational, and family functioning.",
            "Return to the level of psychological functioning prior to exposure to the traumatic event.",
            "No longer experience intrusive event recollections, avoidance of event reminders, intense arousal, or disinterest in activities or relationships.",
            "Think about or openly discusses the traumatic event with others without experiencing psychological or physiological distress.",
            "No longer avoid persons, places, activities, and objects that are reminiscent of the traumatic event.",
            "Life is satisfying; emotions stable and controlled; social, occupational, and family life are fulfilling."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe in as much detail as comfort allows the experience(s) with trauma and history of PTSD symptoms.",
            "Cooperate with psychological testing.",
            "Acknowledge any substance use.",
            "Verbalize any symptoms of depression, including any suicidal thoughts.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Cooperate with a medication evaluation to assess for the usefulness of psychotropic medication in the treatment plan.",
            "Verbalize an understanding of an evidence based therapy that focuses on the relationship between thoughts about the trauma and emotions and behaviors.",
            "Verbalize an accurate understanding of PTSD, how it develops, and persists.",
            "Verbalize an understanding of the cognitive treatment rationale for PTSD.",
            "Learn and implement calming skills.",
            "At one's level of comfort and detail, explore with the therapist the traumatic experience(s) and process thoughts, feelings, and actions associated with it.",
            "Identify, challenge, and replace biased, negative, and self defeating thoughts resulting from the trauma with reality based alternatives.",
            "Participate in prolonged exposure therapy to reduce fear and avoidance associated with the trauma and increase confidence in one's strength.",
            "Participate in an exposure therapy augmented by use of virtual reality.",
            "Learn and implement personal skills to manage challenging situations related to trauma.",
            "Learn and implement guided self dialog to manage thoughts, feelings, and urges brought on by encounters with trauma related situations.",
            "Participate in eye movement desensitization and reprocessing (EMDR) to reduce emotional distress related to traumatic thoughts, feelings, and images.",
            "To one's comfort level, discuss with the therapist painful emotions associated with the trauma, impacts, and what has been learned through the experience.",
            "Participate in an individual or group narrative exposure therapy that explores ways in which trauma may fit into the one's life story.",
            "Participate in acceptance and commitment therapy (ACT) to facilitate posttraumatic growth.",
            "Acknowledge the need to implement anger control techniques and build new anger management skills.",
            "Learn and implement approaches for addressing shame and self disparagement resulting from the trauma.",
            "Implement a regular exercise regimen for general health and stress management benefits.",
            "Sleep without being disturbed by dreams of the trauma.",
            "Participate in conjoint and/or family therapy sessions.",
            "Verbalize an understanding of relapse prevention.",
            "Learn and implement strategies to prevent relapse of PTSD."
        ]
    },
    {
        "areaOfFocus": "Psychoticism",
        "longTermGoals": [
            "Control or eliminate active psychotic symptoms so that functioning is positive and medication is taken consistently.",
            "Eliminate acute, reactive, psychotic symptoms and return to normal functioning.",
            "Increase goal directed behaviors.",
            "Focus thoughts on reality.",
            "Normalize speech patterns, which can be evidenced by coherent statements, attentions to social cues, and remaining on task.",
            "Interact with others without defensiveness or anger.",
            "Achieve and maintain an active, personally effective recovery approach."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Provide the history and the current status of psychotic symptoms.",
            "Participate in psychological testing that will help increase understanding of the condition.",
            "Allow family members to participate in the assessment of the condition.",
            "Cooperate with a physician's evaluation of medical health.",
            "Disclose substance abuse as a precipitating trigger for psychotic symptoms.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Cooperate with services focused on stabilizing the current acute psychotic episode.",
            "Acknowledge any thoughts of suicide.",
            "Obtain agreements for immediate, temporary support or supervision from friends, peers, or family members.",
            "Report a decrease in psychotic symptoms through the consistent use of psychotropic medications.",
            "Participate with family and/or significant others in a therapy designed to improve quality of life for all members and facilitate personal recovery.",
            "Learn and implement effective communication skills with family and/or significant others.",
            "Implement problem solving skills with family and/or significant others to address problems that arise.",
            "Complete exercises between sessions to practice newly learned personal and interpersonal skills.",
            "Develop and participate in a family relapse prevention and management plan in the event that psychotic symptoms return.",
            "Participate in a psychoeducational program with other families.",
            "Identify internal and environmental triggers of psychotic symptoms.",
            "Identify current reactions to symptoms and their impact on self and others.",
            "Learn and implement skills that increase personal effectiveness and resistance to subsequent psychotic episodes.",
            "Identify and change self talk and beliefs that interfere with recovery.",
            "Verbalize an understanding of the need to learn new and improved social skills.",
            "Participate in individual or group therapy focused on improving social effectiveness.",
            "Read about social skills training in books or manuals recommended by the therapist.",
            "Practice and strengthen skills learned in therapy.",
            "Learn a nonjudgmental, accepting approach to experiences and engaging in action toward personally meaningful goals.",
            "Participate in a therapy to practice mental tasks and learn strategies to improve mental, emotional, and social functioning.",
            "Participate in a training program to build job skills.",
            "Verbalize the acceptance of mental illness and willingness to engage in recovery, decreasing feelings of stigmatization.",
            "Attend a support group for others with severe mental illness."
        ]
    },
    {
        "areaOfFocus": "Sexual Abuse Victim",
        "longTermGoals": [
            "Resolve the issue of being sexually abused with an increased capacity for intimacy in relationships.",
            "Begin the healing process from sexual abuse with resultant enjoyment of appropriate sexual contact.",
            "Work successfully through the issues related to being sexually abused with consequent understanding and control of feelings.",
            "Recognize and accept the sexual abuse without inappropriate sexualization of relationships.",
            "Establish whether sexual abuse occurred.",
            "Begin the process of moving away from being a victim of sexual abuse and toward becoming a survivor of sexual abuse."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Tell the story of the nature, frequency, and duration of the abuse.",
            "Disclose any emotional problems resulting from the sexual abuse.",
            "Disclose any history of substance use that may contribute to and complicate the treatment of sexual abuse.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Identify a support system of key individuals who will be encouraging and helpful in aiding the process of resolving the issue.",
            "Verbalize an increased knowledge of sexual abuse and its effects.",
            "Identify and express the feelings connected to the abuse.",
            "Decrease the secrecy in the family by informing key nonabusive members regarding the abuse.",
            "Describe how a sex abuse experience is part of a family pattern of broken boundaries.",
            "Verbalize the ways the sexual abuse has had an impact on life.",
            "Clarify memories of the abuse.",
            "Decrease statements of shame, being responsible for the abuse, or being a victim, while increasing statements that reflect personal empowerment.",
            "Identify the positive benefits for self of being able to forgive all those involved with the abuse.",
            "Express feelings to and about the perpetrator, including the impact the abuse has had both at the time of occurrence and currently.",
            "Increase level of forgiveness of self, perpetrator, and others connected with the abuse.",
            "Increase level of trust of others as shown by more socialization and greater intimacy tolerance.",
            "Report increased ability to accept and initiate appropriate physical contact with others.",
            "Verbalize identify self as a survivor of sexual abuse."
        ]
    },
    {
        "areaOfFocus": "Sexual Orientation Confusion",
        "longTermGoals": [
            "Identify sexual orientation and engage in a wide range of relationships that are supportive of that orientation.",
            "Reduce overall frequency and intensity of the anxiety associated with sexual orientation so that daily functioning is not impaired.",
            "Disclose sexual orientation to supportive significant others.",
            "Return to previous level of emotional, psychological, and social functioning.",
            "Eliminate all feelings of depression (e.g., depressed mood, guilt, worthlessness)."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe fear, anxiety, and distress about confusion over sexual orientation.",
            "Disclose any history of substance use that may contribute to and complicate the treatment of sexual orientation confusion.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Identify sexual experiences that have been a source of excitement, satisfaction, and emotional gratification.",
            "Verbalize an understanding of how cultural, racial, religious, and/or ethnic identity factors contribute to confusion about sexual orientation.",
            "Write a “future” biography detailing life as straight and as gay to assist in identifying primary orientation.",
            "Verbalize an understanding of the range of sexual orientations possible.",
            "Identify the negative emotions experienced by hiding sexuality.",
            "Verbalize an understanding of safer sex practices.",
            "Verbalize an increased understanding of sexual orientation.",
            "List the advantages and disadvantages of disclosing sexual orientation to significant people in life.",
            "Watch films/videos that depict sexual and gender minorities in positive ways.",
            "Attend a support group for those who want to disclose his/her/their sexual orientation.",
            "Identify sexual and gender minorities to socialize with or to obtain support from.",
            "Develop a plan detailing when, where, how, and to whom sexual orientation is to be disclosed.",
            "Identify one friend who is likely to have a positive reaction to the disclosure of sexual orientation.",
            "Reveal sexual orientation to significant others according to written plan."
        ]
    },
    {
        "areaOfFocus": "Sleep Disturbance",
        "longTermGoals": [
            "Restore restful sleep pattern.",
            "Feel refreshed and energetic during wakeful hours.",
            "Terminate anxiety producing dreams that cause awakening.",
            "End abrupt awakening in terror and return to peaceful, restful sleep pattern.",
            "Restore restful sleep with reduction of sleepwalking incidents."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe the history and details of sleep pattern.",
            "Share history of substance abuse or medication use.",
            "Verbalize depressive or anxious feelings and share possible causes.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Keep medical/medication evaluation appointment to assess possible medical and substance induced contributions to sleep disorder as well as the need for psychotropic medications.",
            "Take psychotropic medication as prescribed to assess the effect on sleep.",
            "Verbalize an understanding of normal sleep, sleep disturbances, and their treatment.",
            "Learn and implement calming skills for use at bedtime.",
            "Practice good sleep hygiene.",
            "Learn and implement stimulus control strategies to establish a consistent sleep wake cycle.",
            "Learn and implement a sleep restriction method to increase sleep efficiency.",
            "Identify, challenge, and replace self talk contributing to sleep disturbance with positive, realistic, and reassuring self talk.",
            "Understand and implement a paradoxical instruction to stay awake as a means to counter anxiety interfering with sleep onset.",
            "Learn and implement skills for managing stresses contributing to the sleep problem.",
            "Verbalize an understanding of the cognitive behavioral approach to treating sleeplessness.",
            "Participate in a scheduled awakening procedure to reduce the frequency of night wakening.",
            "Learn and implement relapse prevention practices.",
            "Discuss experiences of emotional traumas that may disturb sleep.",
            "Discuss fears regarding relinquishing control.",
            "Disclose fears of death that may contribute to sleep disturbance.",
            "Reveal any sexual abuse incidents from the past that continue to be disturbing."
        ]
    },
    {
        "areaOfFocus": "Social Anxiety",
        "longTermGoals": [
            "Interact socially without undue fear or anxiety.",
            "Participate in social performance requirements without undue fear or anxiety.",
            "Develop the essential social skills that will enhance the quality of relationship life.",
            "Develop the ability to form relationships that will enhance recovery support system.",
            "Reach a personal balance between solitary time and interpersonal interaction with others."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe the history and nature of social fears and avoidance.",
            "Complete psychological tests designed to assess the nature and severity of social anxiety and avoidance.",
            "Disclose any history of substance use that may contribute to and complicate the treatment of social anxiety.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Cooperate with a medication evaluation to assess the potential usefulness of psychotropic medication in the treatment plan.",
            "Take prescribed psychotropic medications consistently.",
            "Participate in an individual or small group therapy for social anxiety.",
            "Verbalize an accurate understanding of the vicious cycle of social anxiety and avoidance.",
            "Verbalize an understanding of the rationale for cognitive behavioral treatment of social anxiety.",
            "Learn and implement calming and coping strategies to manage anxiety symptoms during moments of social anxiety and lead to a more relaxed state in general.",
            "Learn and implement attentional focusing skills for use in social situations.",
            "Learn and implement social skills to reduce anxiety and build confidence in social interactions.",
            "Participate in behavioral experiments/exposure to feared social situations within and outside of therapy.",
            "Implement relapse prevention strategies for managing possible future anxiety symptoms.",
            "Participate in acceptance and mindfulness based therapy for social anxiety.",
            "Identify important people in life, past and present, and describe the quality, good and poor, of those relationships.",
            "Verbalize and demonstrate an understanding and resolution of current interpersonal problems.",
            "Explore past experiences that may be the source of low self esteem and social anxiety currently.",
            "Work through developmental conflicts that may be influencing current struggles with fear and avoidance and take appropriate present day actions.",
            "Revisit early memories unpleasant social situations from different perspectives toward seeing them in a new way.",
            "Verbally describe the defense mechanisms used to avoid close relationships.",
            "Return for a follow up session to track progress, reinforce gains, and problem solve barriers."
        ]
    },
    {
        "areaOfFocus": "Somatic Symptom/Illness Anxiety",
        "longTermGoals": [
            "Reduce frequency of physical complaints and improve the level of independent functioning.",
            "Accept somatic symptoms as present but not so serious as to interfere with daily functioning.",
            "Reduce verbalizations focusing on pain while increasing productive activities.",
            "Accept self as relatively healthy with no known significant medical illness or defects and stop the preoccupation with physical health or minor symptoms.",
            "Improve physical functioning due to development of adequate coping mechanisms for stress management."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Verbalize health concerns and/or negative feelings regarding body as well as feared consequences of perceived body abnormality.",
            "Complete psychological tests designed to assess the depth and breadth of the presenting problem(s).",
            "Disclose any history of substance use that may contribute to and complicate the treatment of somatization.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Cooperate with a medical evaluation to assess the somatic symptom concerns.",
            "Cooperate with an evaluation by a prescriber for psychotropic medication.",
            "Take psychotropic medications consistently.",
            "Participate in individual or group cognitive behavioral therapy.",
            "Verbalize an understanding of the rationale for treatment.",
            "Identify and replace biased, fearful self talk and beliefs with realistic, accepting self talk and beliefs.",
            "Discuss current stresses that may influence physical complaints.",
            "Participate in repeated imaginal and/or live exposure to feared external and/or internal cues.",
            "Learn and implement calming skills to reduce overall anxiety and manage anxiety symptoms.",
            "Learn and implement problem solving strategies for effectively addressing worries.",
            "Complete homework assignments involving exposure to feared external and/or internal cues.",
            "Implement the use of the “thought stopping” technique to interrupt anxiety driven thoughts and actions.",
            "Express thoughts and feelings assertively and directly.",
            "Learn and implement guided self dialog to manage thoughts, feelings, and urges brought on by encounters with trauma related situations.",
            "Learn about health anxiety through completion of prescribed reading.",
            "Implement maintenance strategies for managing possible future lapses.",
            "Discuss causes for emotional stress in life that underlie the focus on physical complaints.",
            "Identify family patterns that exist around exaggerated focus on physical maladies.",
            "Verbalize the secondary gain that results from physical complaints.",
            "Participate in acceptance and commitment therapy (ACT) for health/appearance worries.",
            "Increase social and productive activities rather than being preoccupied with self and physical complaints.",
            "Decrease physical complaints, doctor visits, and reliance on medication while increasing verbal assessment of self as able to function normally and productively.",
            "Engage in normal responsibilities vocationally and socially without complaining or withdrawing into avoidance while using physical problems as an excuse.",
            "Make and attend appointment at a pain clinic."
        ]
    },
    {
        "areaOfFocus": "Spiritual Confusion",
        "longTermGoals": [
            "Clarify spiritual concepts and instill a freedom to approach a higher power as a resource for support.",
            "Increase belief in and development of a relationship with a higher power.",
            "Begin a faith in a higher power and incorporate it into support system.",
            "Resolve issues that have prevented faith or belief from developing and growing."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Summarize the highlights of own spiritual quest or journey to this date.",
            "Describe beliefs and feelings around the idea of a higher power.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Describe early life training in spiritual concepts and identify its impact on current religious beliefs.",
            "Verbalize an increased knowledge and understanding of the concept of a higher power.",
            "Identify specific blocks to believing in a higher power.",
            "Identify the difference between religion and faith.",
            "Replace the concept of a higher power as harsh and judgmental with a belief in a higher power as forgiving and loving.",
            "Implement daily attempts to be in contact with higher power.",
            "Verbalize separation of beliefs and feelings regarding one's earthly father from those regarding a higher power.",
            "Acknowledge the need to separate negative past experiences with religious people from the current spiritual evaluation.",
            "Verbalize acceptance of forgiveness from a higher power.",
            "Ask a respected person who has apparent spiritual depth to serve as a mentor.",
            "Attend groups dedicated to enriching spirituality.",
            "Read books that focus on furthering a connection with a higher power."
        ]
    },
    {
        "areaOfFocus": "Substance Use",
        "longTermGoals": [
            "Accept the fact of chemical dependence and begin to actively participate in a recovery program.",
            "Establish a sustained recovery, free from the use of all mood altering substances.",
            "Establish and maintain total abstinence while increasing knowledge of the disease and the process of recovery.",
            "Acquire the necessary skills to maintain long term sobriety from all mood altering substances.",
            "Withdraw from mood altering substance, stabilize physically and emotionally, and then establish a supportive recovery plan.",
            "Utilize behavioral and cognitive coping skills to help maintain sobriety."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe the type, amount, frequency, and history of substance abuse.",
            "Complete psychological tests designed to assess the nature and severity of substance abuse.",
            "Participate in a medical evaluation to assess the effects of chemical dependence.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Cooperate with a medication evaluation to assess whether psychotropic medication may be useful to the treatment plan.",
            "Explore and resolve ambivalence associated with commitment to change behaviors related to substance use and addiction.",
            "Commit self to an action plan directed toward termination of substance use.",
            "Attend Alcoholics Anonymous/ Narcotics Anonymous (AA/NA) meetings as frequently as necessary to support sobriety.",
            "Agree to make amends to significant others who have been hurt by the life dominated by substance abuse.",
            "Verbalize increased knowledge of substance use and the process of recovery.",
            "Verbalize an understanding of factors that can contribute to development of a substance related disorder and pose risks for relapse.",
            "Identify level of happiness in various areas of life.",
            "Develop goals to increase satisfaction and pleasure in unsatisfactory, nondrinking areas of life.",
            "Learn and implement communication and problem solving skills toward achieving goals.",
            "Cooperate with exploration of increasing satisfaction in areas of life that can support sobriety such as employment, recreation, and relationships.",
            "Participate in behavioral couples therapy designed to increase the non substance using partner's reinforcement of sobriety and to reduce relationship conflict.",
            "Identify, challenge, and replace destructive, high risk self talk with positive, strength building self talk.",
            "Earn rewards by submitting drug negative urine samples.",
            "Earn rewards by maintaining attendance in treatment.",
            "Verbalize an understanding of lapse and relapse.",
            "Implement relapse prevention strategies for managing possible future situations with high risk for relapse."
        ]
    },
    {
        "areaOfFocus": "Suicidal Ideation",
        "longTermGoals": [
            "Alleviate the suicidal impulses/ideation and return to the highest level of previous daily functioning.",
            "Stabilize the suicidal crisis.",
            "Placement in an appropriate level of care to safely address the suicidal crisis.",
            "Reestablish a sense of hope for self and the future.",
            "Cease the perilous lifestyle and resolve the emotional conflicts that underlie the suicidal pattern."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Honestly share suicidal thoughts, feelings, and actions including intent, plan, and past attempts.",
            "Disclose any history of substance use that may contribute to and complicate the treatment of suicidal ideation.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Explore and resolve ambivalence associated with commitment to engage in therapy for suicidal vulnerabilities.",
            "Work cooperatively with the therapist, completing the Suicide Status Form, and collaboratively developing a plan for addressing suicidal thoughts and feelings.",
            "Identify and record personal warning signs that signal a suicide crisis is developing.",
            "Identify and record on a crisis card personal reasons for living.",
            "Develop strategies for coping with the suicide crisis that include self soothing and identifying social and professional supports.",
            "Implement the use of a “crisis card” that lists the steps of a crisis response plan.",
            "Client and/or significant others increase the safety of the home by removing firearms or other potentially lethal means to suicide from easy access.",
            "Cooperate with hospitalization if the suicidal urge becomes uncontrollable.",
            "Cooperate with a medication evaluation to explore the usefulness of medication in the treatment plan.",
            "Take psychotropic medications as prescribed and report on effectiveness and side effects.",
            "Share any history of struggles with other mental disorders that may magnify the potential for suicidal thinking.",
            "Learn and implement calming and self soothing skills to regulate emotional reactivity.",
            "Establish or reestablish a consistent eating and sleeping pattern.",
            "Identify and change beliefs and thinking patterns that have led to suicidal thoughts, feelings, and actions.",
            "Learn and implement problem solving and decision making skills.",
            "Learn and implement behavioral strategies designed to increase engagement in rewarding activities.",
            "Learn and implement relapse prevention skills.",
            "Identify life factors that preceded the suicidal ideation.",
            "Increase communication with significant others, resulting in a feeling of understanding, empathy, and being attended to.",
            "Identify how previous attempts to solve interpersonal problems have failed, leading to feelings of abject loneliness and rejection.",
            "Identify the positive aspects, relationships, and achievements in his/her/their life.",
            "Verbalize the devastating effects that suicide can have on significant others.",
            "Verbalize a feeling of support that results from spiritual faith."
        ]
    },
    {
        "areaOfFocus": "Type A Behavior",
        "longTermGoals": [
            "Formulate and implement a new life attitudinal pattern that allows for a more relaxed pattern of living.",
            "Reach a balance between work/competitive and social/noncompetitive time in daily life.",
            "Achieve an overall decrease in pressured, driven behaviors.",
            "Develop social and recreational activities as a routine part of life.",
            "Alleviate sense of time urgency, free floating anxiety, anger, and self destructive behaviors."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe the pattern of pressured, driven living.",
            "Comply with psychological assessment.",
            "Disclose any history of substance use that may contribute to and complicate the treatment of Type A behavior.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Identify the beliefs that support driven, overachieving behavior.",
            "Verbalize a desire to reprioritize values toward less self focus, more inner and other orientation.",
            "Discuss advantages and disadvantages of taking steps toward creating a balanced and rewarding lifestyle toward making a decision to engage in treatment.",
            "Verbalize a commitment to learning new approaches to managing self, time, and relationships.",
            "Develop the pattern of doing one task at a time with less emphasis on pressure to complete it quickly.",
            "Decrease the number of hours worked daily and the frequency of taking work home.",
            "Learn and implement calming skills as a lifestyle change and to manage pressure situations.",
            "Increase daily time involved in relaxing activities.",
            "Identify and replace distorted automatic thoughts that motivate and reward pressured living.",
            "Verbalize a recognition of hostility toward and impatience with others.",
            "Learn and implement respectful assertive communication knowledge and skills to replace aggressive forms of communication.",
            "Learn and implement problem solving and/or conflict resolution skills to manage interpersonal problems.",
            "Practice using new calming, cognitive, communication, and problem solving skills in session with the therapist and during homework exercises.",
            "Demonstrate increased patience with others by listening to them talk of his/her/their life experiences and then verbalizing the good qualities noted in others.",
            "Attend a weekend group activity designed to expand self awareness and cooperation.",
            "Increase interest in the lives of others as evidenced by engaging in acts of kindness.",
            "Develop a daily routine that reflects a balance between the quest for achievement and appreciation of aesthetics.",
            "Participate in acceptance and commitment therapy (ACT) to learn a new approach to life and its stresses."
        ]
    },
    {
        "areaOfFocus": "Vocational Stress",
        "longTermGoals": [
            "Improve satisfaction and comfort surrounding coworker relationships.",
            "Increase sense of confidence and competence in dealing with work responsibilities.",
            "Be cooperative with and accepting of supervision of direction in the work setting.",
            "Increase sense of self esteem and elevation of mood in spite of unemployment.",
            "Increase job security as a result of more positive evaluation of performance by a supervisor.",
            "Pursue employment consistency with a reasonably hopeful and positive attitude.",
            "Increase job satisfaction and performance due to implementation of assertiveness and stress management strategies."
        ],
        "shortTermObjectives": [
            "Work cooperatively with the therapist toward agreed upon therapeutic goals while being as open and honest as comfort and trust allow.",
            "Describe the nature and history of the vocational stress.",
            "Complete psychological tests designed to assess the nature and severity of social anxiety and avoidance.",
            "Disclose any history of substance use that may contribute to and complicate the treatment of vocational stress.",
            "Provide behavioral, emotional, and attitudinal information toward an assessment of specifiers relevant to a DSM diagnosis, the efficacy of treatment, and the nature of the therapy relationship.",
            "Cooperate with an evaluation by a prescriber for psychotropic medication.",
            "Take psychotropic medication as prescribed and report as to effectiveness and side effects.",
            "Participate in a therapy to alleviate stress and achieve personal goals.",
            "Identify and implement behavioral changes that could be made in workplace interactions to help resolve conflicts with coworkers or supervisors.",
            "Learn and implement assertiveness communication skills.",
            "Learn and implement problem solving skills.",
            "Verbalize healthy, realistic cognitive messages that promote harmony with others, self acceptance, and self confidence.",
            "Identify and replace biased cognitive messages associated with feelings of job stress.",
            "Learn and implement calming skills to reduce overall anxiety and manage anxiety symptoms.",
            "Identify own role in the conflict with coworkers or supervisor.",
            "Identify any personal problems that may be causing conflict in the employment setting.",
            "Review family of origin history to determine roots for interpersonal conflict.",
            "Identify patterns of similar conflict with people outside the work environment.",
            "Replace projection of responsibility for the conflict with acceptance of responsibility for own role in conflict.",
            "Identify the effect that vocational stress has on feelings toward self and relationships with significant others.",
            "Develop and verbalize a plan for constructive action to reduce vocational stress.",
            "Verbalize an understanding of circumstances that led up to being terminated from employment.",
            "Cease self disparaging comments that are based on perceived failure at workplace.",
            "Outline plan for job search.",
            "Report on job search experiences and feelings surrounding these experiences."
        ]
    }
]
